
Функция СформироватьКлавиатуру(text = "", level = 0, from_id = "") Экспорт 
	ДанныеВозврата = Новый Структура;
	message = "Каталог не отрабатывает";

	Если text = "Start" ИЛИ text = "Начать" Тогда
		buttons = СформироватьГлавноеМеню();
		message = "Привет! Вы только начали работу с этим ботом." + Символы.ПС + "Это бот-продавец товаров."; 
	ИначеЕсли text = "Каталог" Тогда
		template = СформироватьКарусель();
		buttons = СформироватьГлавноеМеню(); 
		//message = "В нашем магазине есть такие товары!";
		ДанныеВозврата.Вставить("template", template);
	Иначе
		buttons = СформироватьГлавноеМеню(); 
		message = "Привет! Вы уже со мной общались. Посмотрите на мое главное меню."; 
	КонецЕсли;
	
	ДанныеВозврата.Вставить("keyboard", СформироватьJSONКлавиатуры(buttons));
	ДанныеВозврата.Вставить("message", message);
	
	Возврат ДанныеВозврата;

КонецФункции   

Функция СформироватьГлавноеМеню()
	buttons = Новый Массив; 
	
	РядКнопок = Новый Массив;
	РядКнопок.Добавить(СформироватьКнопку("Каталог", "Каталог", 1));
	buttons.Добавить(РядКнопок); 
	
	РядКнопок = Новый Массив;
	РядКнопок.Добавить(СформироватьКнопку("Заказы", "Заказы", 1));
	buttons.Добавить(РядКнопок); 
	
	РядКнопок = Новый Массив;
	РядКнопок.Добавить(СформироватьКнопку("FAQ", "FAQ", 1));
	buttons.Добавить(РядКнопок);
	
	Возврат buttons;
	
КонецФункции  

// Разобраться как формировать payload
Функция СформироватьКнопку(label = "Test", payload_button, payload_level, color = "default", type = "text")
    //СтруктураPayload = Новый Структура;
	//СтруктураPayload.Вставить("button", payload_button);
	//СтруктураPayload.Вставить("level", payload_level); 
	
	//payload = СформироватьJSON(СтруктураPayload);
	
	action = Новый Структура;
	action.Вставить("type", type);
	action.Вставить("label", label);
	//action.Вставить("payload", payload);
	
	button = Новый Структура;
	button.Вставить("action", action);
	button.Вставить("color", color); 
	
	Возврат button;
	
КонецФункции  

//Вот примерно так выглядит JSON файл клавиатуры
//{
//  "one_time": false,
//  "buttons":[
//    [
//      {
//        "action":{
//          "type":"location",
//          "payload":"{\"button\": \"1\"}"
//        }
//      }
//    ],
//    [
//      {
//        "action":{
//          "type":"vkpay",
//          "hash":"action=transfer-to-group&group_id=12345&aid=10"
//        }
//      }
//    ],
//    [
//      {
//        "action":{
//          "type":"text",
//          "payload":"{\"button\": \"1\"}",
//          "label":"Red"
//        },
//        "color":"negative"
//      },
//      {
//        "action":{
//          "type":"text",
//          "payload":"{\"button\": \"2\"}",
//          "label":"Green"
//        },
//        "color":"positive"
//      },
//      {
//        "action":{
//          "type":"text",
//          "payload":"{\"button\": \"2\"}",
//          "label":"Blue"
//        },
//        "color":"primary"
//      },
//      {
//        "action":{
//          "type":"text",
//          "payload":"{\"button\": \"2\"}",
//          "label":"White"
//        },
//        "color":"secondary"
//      }
//    ]
//  ]
//}
Функция СформироватьJSONКлавиатуры(buttons)
    keyboard = Новый Структура;
	keyboard.Вставить("one_time", false);
	keyboard.Вставить("buttons", buttons);  	
	//keyboard.Вставить("inline", true);
	
	keyboardJSON = VK.СформироватьJSON(keyboard);
	
	Возврат keyboardJSON;
КонецФункции  

Функция СформироватьКарусель();   
	elements = СформироватьЭлементыКарусели();
	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("type", "carousel");
	ДанныеВозврата.Вставить("elements", elements);
 
    Возврат VK.СформироватьJSON(ДанныеВозврата);
КонецФункции

Функция СформироватьЭлементыКарусели()
    Элементы = Новый Массив;
	
	// Добавляем элементы в массив
	Элементы.Добавить(СоздатьЭлемент("Заголовок 1", "Описание 1", "https://vk.com", "Кнопка 1"));
	Элементы.Добавить(СоздатьЭлемент("Заголовок 2","Описание 2", "https://ya.ru", "Кнопка 2"));

	Возврат Элементы;
КонецФункции  

// функция-утилита для создания одного элемента
Функция СоздатьЭлемент(Заголовок, Описание, Ссылка, МеткаКнопки)
    Элемент = Новый Структура;
    //Элемент.Вставить("photo_id", Фото);
    Элемент.Вставить("title", Заголовок);
    Элемент.Вставить("description", Описание);

    // действия по клику на элемент
    Действие = Новый Структура;
    Действие.Вставить("type", "open_link");
    Действие.Вставить("link", Ссылка);
    Элемент.Вставить("action", Действие);

    // кнопки внутри элемента
    Кнопка = Новый Структура;
    ДействиеКнопки = Новый Структура;
    ДействиеКнопки.Вставить("type", "text");
    ДействиеКнопки.Вставить("label", МеткаКнопки);
    Кнопка.Вставить("action", ДействиеКнопки);
	
	МассивКнопок = Новый Массив;
	МассивКнопок.Добавить(Кнопка);
	
    Элемент.Вставить("buttons", МассивКнопок);
    Возврат Элемент;  
	
КонецФункции


