
Функция СформироватьКлавиатуру(text = "", level = 0, from_id = "") Экспорт 
	ДанныеВозврата = Новый Структура;
	message = "Нихрена не прилетает блять";
	buttons = СформироватьГлавноеМеню();
	
	Если text = "catalog" Тогда 
	    message = "Выберите товар:"; 
		СтрКарусели = Товары.СформироватьСписокТоваров();
	    ДанныеВозврата.Вставить("template", СтрКарусели); 
		
		//message = СтрКарусели;
	ИначеЕсли text = "orders" Тогда
		message = "Это текст для Заказов";
	ИначеЕсли text = "FAQ" Тогда
		message = "Это текст для FAQ";
	Иначе
		message = "Это дефолтный текст";
	КонецЕсли;                        
	
	ДанныеВозврата.Вставить("keyboard", СформироватьJSONКлавиатуры(buttons));
	ДанныеВозврата.Вставить("message", message);
	
	Возврат ДанныеВозврата;

КонецФункции   

Функция СформироватьГлавноеМеню()
	buttons = Новый Массив; 
	
	РядКнопок = Новый Массив;
	РядКнопок.Добавить(СформироватьКнопку("Каталог", "catalog", 1));
	buttons.Добавить(РядКнопок); 
	
	РядКнопок = Новый Массив;
	РядКнопок.Добавить(СформироватьКнопку("Заказы", "orders", 1));
	buttons.Добавить(РядКнопок); 
	
	РядКнопок = Новый Массив;
	РядКнопок.Добавить(СформироватьКнопку("FAQ", "FAQ", 1));
	buttons.Добавить(РядКнопок);
	
	Возврат buttons;
	
КонецФункции  

// Разобраться как формировать payload
Функция СформироватьКнопку(label = "Test", payload_button, payload_level, color = "default", type = "text")
    СтруктураPayload = Новый Структура;
	СтруктураPayload.Вставить("button", payload_button);
	СтруктураPayload.Вставить("level", payload_level); 
	
	//payload = VK.СформироватьJSON(СтруктураPayload);
	
	action = Новый Структура;
	action.Вставить("type", type);
	action.Вставить("label", label);
	action.Вставить("payload", СтруктураPayload);
	
	button = Новый Структура;
	button.Вставить("action", action);
	button.Вставить("color", color); 
	
	Возврат button;
	
КонецФункции  

//Вот примерно так выглядит JSON файл клавиатуры
//{
//  "one_time": false,
//  "buttons":[
//    [
//      {
//        "action":{
//          "type":"location",
//          "payload":"{\"button\": \"1\"}"
//        }
//      }
//    ],
//    [
//      {
//        "action":{
//          "type":"vkpay",
//          "hash":"action=transfer-to-group&group_id=12345&aid=10"
//        }
//      }
//    ],
//    [
//      {
//        "action":{
//          "type":"text",
//          "payload":"{\"button\": \"1\"}",
//          "label":"Red"
//        },
//        "color":"negative"
//      },
//      {
//        "action":{
//          "type":"text",
//          "payload":"{\"button\": \"2\"}",
//          "label":"Green"
//        },
//        "color":"positive"
//      },
//      {
//        "action":{
//          "type":"text",
//          "payload":"{\"button\": \"2\"}",
//          "label":"Blue"
//        },
//        "color":"primary"
//      },
//      {
//        "action":{
//          "type":"text",
//          "payload":"{\"button\": \"2\"}",
//          "label":"White"
//        },
//        "color":"secondary"
//      }
//    ]
//  ]
//}
Функция СформироватьJSONКлавиатуры(buttons, inline = false)
    keyboard = Новый Структура;
	keyboard.Вставить("one_time", false);
	keyboard.Вставить("buttons", buttons);  	
	keyboard.Вставить("inline", inline);
	
	keyboardJSON = VK.СформироватьJSON(keyboard);
	
	Возврат keyboardJSON;
КонецФункции  

Функция СформироватьКарусель();   
	elements = СформироватьЭлементыКарусели();
	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("type", "carousel");
	ДанныеВозврата.Вставить("elements", elements);
 
    Возврат VK.СформироватьJSON(ДанныеВозврата);
КонецФункции

Функция СформироватьЭлементыКарусели()
    Элементы = Новый Массив;
	
	// Добавляем элементы в массив
	Элементы.Добавить(СоздатьЭлемент("Заголовок 1", "Описание 1", , "Кнопка 1", "btn1"));
	Элементы.Добавить(СоздатьЭлемент("Заголовок 2","Описание 2", , "Кнопка 2", "btn2"));

	Возврат Элементы;
КонецФункции  

// функция-утилита для создания одного элемента
Функция СоздатьЭлемент(title, desc, type = "text", label, payload = "1") Экспорт
    Элемент = Новый Структура;
    //Элемент.Вставить("photo_id", Фото);
    Элемент.Вставить("title", title);
    Элемент.Вставить("description", desc);

    // действия по клику на элемент
    Действие = Новый Структура;
    Действие.Вставить("type", "open_link");
    Действие.Вставить("link", "https://vk.com");
    Элемент.Вставить("action", Действие);

    // кнопки внутри элемента
    Кнопка = Новый Структура;
    ДействиеКнопки = Новый Структура;
    ДействиеКнопки.Вставить("type", type);
    ДействиеКнопки.Вставить("label", label); 
	
	СтруктураPayload = Новый Структура;
	СтруктураPayload.Вставить("button", payload); 
	
	ДействиеКнопки.Вставить("payload", СтруктураPayload); 
	
    Кнопка.Вставить("action", ДействиеКнопки);
	
	МассивКнопок = Новый Массив;
	МассивКнопок.Добавить(Кнопка);
	
    Элемент.Вставить("buttons", МассивКнопок);
    Возврат Элемент;  
	
КонецФункции

