
Функция documentsGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);  
	Ответ.УстановитьТелоИзСтроки("OK", "UTF-8");
	Возврат Ответ;
КонецФункции

Функция documentsPOST(Запрос)

    Попытка
        Тело = Запрос.ПолучитьТелоКакСтроку();
        VK.ЗаписатьЛог("Тело запроса: " + Тело);
        
        Чтение = Новый ЧтениеJSON;
        Чтение.УстановитьСтроку(Тело);
        Параметры = ПрочитатьJSON(Чтение);

        Если Параметры.Свойство("type") Тогда
            VK.ЗаписатьЛог("Тип запроса: " + Параметры.type);
        Иначе
            VK.ЗаписатьЛог("Поле 'type' отсутствует");
        КонецЕсли;

        Если Параметры.Свойство("type") И Параметры.type = "confirmation" Тогда
            VK.ЗаписатьЛог("Подтверждение получено. Возвращаю строку.");
            Ответ = Новый HTTPСервисОтвет(200);
            Ответ.УстановитьТелоИзСтроки("61172d7c", "UTF-8");
            Возврат Ответ;
        Иначе
            VK.ЗаписатьЛог("Другой тип запроса: " + Параметры.type);
        КонецЕсли;

        Ответ = Новый HTTPСервисОтвет(200);
        Ответ.УстановитьТелоИзСтроки("OK", "UTF-8");
        Возврат Ответ;

    Исключение
		VK.ЗаписатьЛог("ОШИБКА: " + ОписаниеОшибки());
        Ответ = Новый HTTPСервисОтвет(200);
        Ответ.УстановитьТелоИзСтроки("error", "UTF-8");
        Возврат Ответ;
    КонецПопытки;

КонецФункции   


