
// Функция принимает JSON-строку и пытается преобразовать её в структуру 1С
Функция ОбработатьJSON(СтрокаJSON) Экспорт  
	СтруктураВозврата = Новый Структура;
	
	Попытка 
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(СтрокаJSON);       
		// Преобразуем JSON в Структуру
		СтруктураВозврата = ПрочитатьJSON(Чтение);
	Исключение  
	КонецПопытки;
	
	Возврат СтруктураВозврата;	
КонецФункции   

Функция СформироватьJSON(СтруктураДанных, ФормироватьСПереносами = Ложь) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	Если ФормироватьСПереносами Тогда
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
	Иначе
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, Символы.Таб));
	КонецЕсли;
	
	НастройкаСериализацииJSON = Новый НастройкиСериализацииJSON;
	НастройкаСериализацииJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением;
	НастройкаСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных, НастройкаСериализацииJSON);
	
	Возврат ЗаписьJSON.Закрыть();	
КонецФункции

// Вот примерно так выглядит JSON файл клавиатуры
//{
//  "one_time": false,
//  "buttons":[
//    [
//      {
//        "action":{
//          "type":"location",
//          "payload":"{\"button\": \"1\"}"
//        }
//      }
//    ],
//    [
//      {
//        "action":{
//          "type":"vkpay",
//          "hash":"action=transfer-to-group&group_id=12345&aid=10"
//        }
//      }
//    ],
//    [
//      {
//        "action":{
//          "type":"text",
//          "payload":"{\"button\": \"1\"}",
//          "label":"Red"
//        },
//        "color":"negative"
//      },
//      {
//        "action":{
//          "type":"text",
//          "payload":"{\"button\": \"2\"}",
//          "label":"Green"
//        },
//        "color":"positive"
//      },
//      {
//        "action":{
//          "type":"text",
//          "payload":"{\"button\": \"2\"}",
//          "label":"Blue"
//        },
//        "color":"primary"
//      },
//      {
//        "action":{
//          "type":"text",
//          "payload":"{\"button\": \"2\"}",
//          "label":"White"
//        },
//        "color":"secondary"
//      }
//    ]
//  ]
//}
Функция СформироватьJSONКлавиатуры(buttons, inline = false) Экспорт
    keyboard = Новый Структура;
	keyboard.Вставить("one_time", false);
	keyboard.Вставить("buttons", buttons);  	
	keyboard.Вставить("inline", inline);
	
	keyboardJSON = СформироватьJSON(keyboard);
	
	Возврат keyboardJSON;
КонецФункции  
