
&НаСервере
Процедура ОтправитьСсылкуНаОплатуНаСервере(Документ, СсылкаНаОплату)
	ОбъектДокумента = Документ.ПолучитьОбъект();
	UserID = ОбъектДокумента.UserID;
	
	// Подготовка параметров для message_send
	Гсч = Новый ГенераторСлучайныхЧисел();
	RandomID = Формат(Гсч.СлучайноеЧисло(), "ЧРГ=''; ЧГ=0");
	message  = "Оплатите заказ по ссылке: " + СсылкаНаОплату;
	ДанныеВозврата = Клавиатура.СформироватьКлавиатуру();   
	keyboard = ДанныеВозврата.keyboard;
	
	VK.message_send(RandomID, UserID, message, keyboard);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСсылкуНаОплату(Команда)
	// Проверяем заполнение полей
	Если НЕ ЗначениеЗаполнено(Заказ) Тогда
		Сообщить("Выберите документ!");
		Возврат;
	КонецЕсли;
	
	Если СсылкаНаОплату = "" Тогда
		Сообщить("Введите ссылку на оплату!");
		Возврат;
	КонецЕсли; 
	
	ОтправитьСсылкуНаОплатуНаСервере(Заказ, СсылкаНаОплату);   
КонецПроцедуры
