// Создать ссылку получения токена
// Получение ссылки для интерактивного получения токена (access_token), который необходим
// для дальнейших действий
//
// Параметры:
//  app_id - Строка,Число - app_id из настроек приложения - app
//
// Возвращаемое значение:
//  Строка - URL, по которому необходимо перейти в браузере

Процедура ПриНачалеРаботыСистемы() Экспорт
    ЗаписатьЛогНаСервере(
        "C:\Users\hellawes\файллога.txt",
        "=== РАСШИРЕНИЕ ПРОСНУЛОСЬ: " + ТекущаяДата() + " ==="
    );
КонецПроцедуры

Функция СоздатьСсылкуПолученияТокена() Экспорт
	ЗаписатьЛогНаСервере(
      "C:\Users\hellawes\файллога.txt",
      "=== ЛОГ " + ТекущаяДата() + " ==="
    );
    Возврат 
      "https://oauth.vk.com/authorize?client_id=53447325&…";
КонецФункции   

Процедура ЗаписатьЛогНаСервере(ПутьКФайлу, Текст)
    ПутьКФайлу = КаталогВременныхФайлов() + "лог.txt";
    ТД = Новый ТекстовыйДокумент;
    ТД.УстановитьТекст(Текст);
    ТД.Записать(ПутьКФайлу, КодировкаТекста.UTF8);
КонецПроцедуры
